<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0537b5039506a48fc18711abf50717f61ca38ce8a3dc8c93a6f7da9b8e3b0950","plan_job_ref":"Job Checks #1 at https://github.com/eezra-publishing/aws-account-baseline/actions/runs/9046008985","plan_out_hash":"fa8db30bd70fcf98a807e86badc8ff954045e00fdbd5c5a8bd1786102461e5d3","plan_hash":"b8505d3f1c54881c942f3ba164cced1ad9e8353dfe34e7f5440fe0f948056e2d","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform/member-account__
With backend config: `bucket=com.590183898139.us-east-1.terraform-backend
key=aws/org-accounts/baseline/Sandbox/ChrisSandbox/member-account
region=us-east-1
dynamodb_table=TerraformBackend
assume_role={role_arn="arn:aws:iam::590183898139:role/TerraformBackendAccessRole_OrgAccounts"}
`
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam.data.template_file.remote_state_key_filter will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "remote_state_key_filter" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = "aws/${ACCOUNT_ID}/application/*"
+       vars     = {
+           "ACCOUNT_ID" = (known after apply)
        }
    }

  # module.iam.aws_iam_group.account_access_group will be created
+   resource "aws_iam_group" "account_access_group" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "AccountAccessGroup_Sand_ChrisSandbox"
+       path      = "/Sandbox/ChrisSandbox/"
+       unique_id = (known after apply)
    }

  # module.iam.aws_iam_group_policy_attachment.deployment_policy will be created
+   resource "aws_iam_group_policy_attachment" "deployment_policy" {
+       group      = "AccountAccessGroup_Sand_ChrisSandbox"
+       id         = (known after apply)
+       policy_arn = (known after apply)
    }

  # module.iam.aws_iam_group_policy_attachment.terraform_backend_access_policy will be created
+   resource "aws_iam_group_policy_attachment" "terraform_backend_access_policy" {
+       group      = "AccountAccessGroup_Sand_ChrisSandbox"
+       id         = (known after apply)
+       policy_arn = (known after apply)
    }

  # module.iam.aws_iam_policy.backend_access_policy will be created
+   resource "aws_iam_policy" "backend_access_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "TerraformBackendAccessPolicy_Sand_ChrisSandbox"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.deployment_policy will be created
+   resource "aws_iam_policy" "deployment_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "TerraformDeploymentPolicy_Sand_ChrisSandbox"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.backend_access_role will be created
+   resource "aws_iam_role" "backend_access_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "TerraformBackendAccessRole_Sand_ChrisSandbox"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.deployment_role will be created
+   resource "aws_iam_role" "deployment_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:AssumeRole",
+                           "sts:TagSession",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::590183898139:role/RootTerraformAccess-GitHubOIDCProviderRole-uGVKzbnx7TR8",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "TerraformDeploymentRole_Sand_ChrisSandbox"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.backend_access_role will be created
+   resource "aws_iam_role_policy_attachment" "backend_access_role" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "TerraformBackendAccessRole_Sand_ChrisSandbox"
    }

  # module.iam.aws_iam_role_policy_attachment.deployment_role will be created
+   resource "aws_iam_role_policy_attachment" "deployment_role" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "TerraformDeploymentRole_Sand_ChrisSandbox"
    }

  # module.member_account.aws_organizations_account.this will be created
+   resource "aws_organizations_account" "this" {
+       arn               = (known after apply)
+       close_on_deletion = true
+       create_govcloud   = false
+       email             = (known after apply)
+       govcloud_id       = (known after apply)
+       id                = (known after apply)
+       joined_method     = (known after apply)
+       joined_timestamp  = (known after apply)
+       name              = "ChrisSandbox"
+       parent_id         = "****************"
+       status            = (known after apply)
+       tags_all          = (known after apply)
    }

  # module.member_account.random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 1
+       separator = "-"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   access_group_name            = "AccountAccessGroup_Sand_ChrisSandbox"
+   account_id                   = (known after apply)
+   backend_access_role_arn      = (known after apply)
+   backend_access_role_name     = "TerraformBackendAccessRole_Sand_ChrisSandbox"
+   deployment_role_arn          = (known after apply)
+   deployment_role_name         = "TerraformDeploymentRole_Sand_ChrisSandbox"
+   email                        = (known after apply)
+   organization_access_role_arn = (known after apply)
```
</details>

:memo: Plan generated in [Checks #1](https://github.com/eezra-publishing/aws-account-baseline/actions/runs/9046008985)